## Reading Data

In [1]:
import pandas as pd

In [28]:
df = pd.read_csv('quikr_car.csv')

In [29]:
df

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
887,Ta,Tara,zest,"3,10,000",NaN,NaN
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

## Data Cleaning

In [30]:
df2 = df.copy()

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

Here we can see that `year`, `price` and `kms_driven` are `object` but it should be `integer` we have to make this change.

### Making `year`, `price` and `kms_driven` to Integer

In [32]:
 df2 = df2[df2['year'].str.isnumeric()]

In [33]:
df2['year'] = df2['year'].astype('int')

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int32
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int32(1), object(5)
memory usage: 42.8+ KB

Now year had changed to integer.

In [35]:
df2['Price']

0             80,000
1           4,25,000
2      Ask For Price
3           3,25,000
4           5,75,000
           ...
886         3,00,000
888         2,60,000
889         3,90,000
890         1,80,000
891         1,60,000
Name: Price, Length: 842, dtype: object

Here we can see that value in price is written as `Ask For Price`, So we will remove that and then changed to integer.

In [36]:
df2 = df2[df2['Price'] != 'Ask For Price']

In [37]:
df2['Price'] = df2['Price'].str.replace(',','')

In [38]:
df2['Price'] = df2['Price'].astype(int)

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int32
 3   Price       819 non-null    int32
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.4+ KB

Now `Price` are also changed to integer.

In [40]:
df2['kms_driven'] = df2['kms_driven'].str.split().str.get(0).str.replace(',','')

In [41]:
df2['kms_driven']

0       45000
1          40
3       28000
4       36000
6       41000
        ...
886    132000
888     27000
889     40000
890    Petrol
891    Petrol
Name: kms_driven, Length: 819, dtype: object

Here we can see that `kms_driven` contains `Petrol` which is wrong So, we will remove this.

In [42]:
df2 = df2[df2['kms_driven'].str.isnumeric()]

In [43]:
df2['kms_driven'] = df2['kms_driven'].astype(int)

In [44]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int32
 3   Price       817 non-null    int32
 4   kms_driven  817 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

Now we have changed `year`, `price` and `kms_driven` to integer.

In [45]:
df2

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,80000,45000,Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,425000,40,Diesel
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,28000,Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,575000,36000,Diesel
6,Ford Figo,Ford,2012,175000,41000,Diesel
...,...,...,...,...,...,...
883,Maruti Suzuki Ritz VXI ABS,Maruti,2011,270000,50000,Petrol
885,Tata Indica V2 DLE BS III,Tata,2009,110000,30000,Diesel
886,Toyota Corolla Altis,Toyota,2009,300000,132000,Petrol
888,Tata Zest XM Diesel,Tata,2018,260000,27000,Diesel
889,Mahindra Quanto C8,Mahindra,2013,390000,40000,Diesel

In [46]:
df2.dropna(inplace=True)

In [47]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 816 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

In [48]:
df2['model'] = df2['name'].str.split().str.slice(1,3).str.join(' ')

In [51]:
df2 = df2.drop(labels=['name'],axis=1)

In [52]:
df2

      company  year   Price  kms_driven fuel_type              model
0     Hyundai  2007   80000       45000    Petrol        Santro Xing
1    Mahindra  2006  425000          40    Diesel         Jeep CL550
3     Hyundai  2014  325000       28000    Petrol          Grand i10
4        Ford  2014  575000       36000    Diesel  EcoSport Titanium
6        Ford  2012  175000       41000    Diesel               Figo
..        ...   ...     ...         ...       ...                ...
883    Maruti  2011  270000       50000    Petrol        Suzuki Ritz
885      Tata  2009  110000       30000    Diesel          Indica V2
886    Toyota  2009  300000      132000    Petrol      Corolla Altis
888      Tata  2018  260000       27000    Diesel            Zest XM
889  Mahindra  2013  390000       40000    Diesel          Quanto C8

[816 rows x 6 columns]

In [53]:
df2 = df2.reset_index(drop=True)

In [54]:
df2

      company  year   Price  kms_driven fuel_type              model
0     Hyundai  2007   80000       45000    Petrol        Santro Xing
1    Mahindra  2006  425000          40    Diesel         Jeep CL550
2     Hyundai  2014  325000       28000    Petrol          Grand i10
3        Ford  2014  575000       36000    Diesel  EcoSport Titanium
4        Ford  2012  175000       41000    Diesel               Figo
..        ...   ...     ...         ...       ...                ...
811    Maruti  2011  270000       50000    Petrol        Suzuki Ritz
812      Tata  2009  110000       30000    Diesel          Indica V2
813    Toyota  2009  300000      132000    Petrol      Corolla Altis
814      Tata  2018  260000       27000    Diesel            Zest XM
815  Mahindra  2013  390000       40000    Diesel          Quanto C8

[816 rows x 6 columns]

In [55]:
df2.to_csv('cleaned_car.csv', index=False)